app/controllers/plays_controller.rb

  def show
    @play = Play.find(params[:id])
    @play_id = @play.id
    if params[:g]
      @gender = GENDER[ params[:g] ]
      @both_gender = GENDER['Both']
      @other_gender = @gender.name.match(/^Men$/) ? GENDER['Women'] : GENDER['Men']
      @monologues = Monologue.find(
        :all,
        :conditions =>
          ['(gender_id = ? OR gender_id = ?) AND play_id = ?', @gender.id, @both_gender.id, @play.id]
      )
---
SELECT * FROM "plays" WHERE ("plays"."id" = 16)
SELECT * FROM "monologues" WHERE ((gender_id = 3 OR gender_id = 1) AND play_id = 16)